# Core CLI — Arch Linux (pacman)
# Install: sudo pacman -Syu --needed - < packages/pacman.txt

# shell & search
zsh
fzf
fd
ripgrep
bat
eza
tree
jq
yq
htop
wget
curl
gnupg
unzip
base-devel

# editors / mux
neovim
tmux
alacritty
ttf-jetbrains-mono-nerd

# git toolkit
git
git-delta
github-cli
lazygit

# languages — prefer fnm via `make node` for LTS; pacman as baseline
nodejs
npm
pnpm
yarn
# fnm  # also: scripts/install-node-toolchain.sh

# containers
docker
docker-compose
